{"_id":{"$oid":"539e26d37734406005794e8d"},"date":"20140601","date_not_format":"6/1/2014","description":"\u003cp\u003eDreamed three times this week of an individual called Maykal, who works for a research institution. He is either disaffected, demoralsed or becomes influenced by extremist.His work is very specialized and the uses of his work if falls into the wrong hands can be very bad.\u003c/p\u003e\u003cp\u003eIn one of the scenes, he works in a an European city, a CERN type facility. I see his face and can draw it. He is about 5 foot, red hair and freckled. He may have. French background. I see an explosion so big it can be seen fom space. A lot of people will die. The scene showed done even being blown to outer atmosphere and space. The type of material he is researching or may fall into wrong hands is a common element like cobalt which has been weaponised. \u003c/p\u003e","description_witness":"\u003cp\u003eWeb programmer\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003edreamed first dream on Sunday about May 25 or so. Second dream was on May 31 and third dream June 1 2014.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Maykal"}
{"_id":{"$oid":"539e26d37734406005794e8e"},"date":"20140629","date_not_format":"29/06/2014. 2020hrs","description":"\u003cp\u003ei dreamed of a plane displaying the malaysian airlines logo on the sides sitting in side an aircraft carrier.\u003c/p\u003e\u003cp\u003eDarkness inside the plane and nobody in side it.\u003c/p\u003e\u003cp\u003eThere was an old carpet smell inside.\u003c/p\u003e\u003cp\u003eOutside the plane were men armed with machine guns strapped over their shoulders just standing around. some were sitting down playing cards.\u003c/p\u003e\u003cp\u003eIt was sunny outside and as i moved outside the plane into the open area, i looked around to see it was some kind of deserted airport but was very clean. huge wired fences. \u003c/p\u003e\u003cp\u003ei woke up and thought this has to be the malaysian airlines MH370 .\u003c/p\u003e","description_witness":"\u003cp\u003emale\u003c/p\u003e\u003cp\u003e51 years\u003c/p\u003e\u003cp\u003elive in nsw australia\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003ei was dreaming.\u003c/li\u003e\u003cli\u003eWasnt thinking of anything at the time.\u003c/li\u003e\u003cli\u003eDidnt even have the missing flight MH370 on my mind.\u003c/li\u003e\u003cli\u003enot even before going to bed.\u003c/li\u003e\u003cli\u003ethis dream happened around 10 minutes into my sleep.\u003c/li\u003e\u003cli\u003e\u003c/ul\u003e","status":"1","title":"I dreamed of a plane displaying the Malaysian Airlines logo"}
{"_id":{"$oid":"539e26d37734406005794e8f"},"date":"20140520","date_not_format":"May 20 2014 7:30","description":"\u003cp\u003e I have had several premonitions over the course of time. My first was the about how my life would change soon My mom and god both explained to me that I would be experiencing a life altering event which did happen. They let me know I would be safe and now a new person would be here soon. They had me seeing and feeling my daughters born to their dad. It happened within a three year time span. I then had the next set of dreams with my mom and god again about my next life change and how there would be all my family and friends there to help. My ex-husband was at work in the dream and he fell to the ground .I saw him going in the ambulance and riding to the hospital with him. I was also there when he dies. My mom said not to worry things will be all right. I thought he had a heart attack in the dream but 4 years later he died from hitting his head on the bathtub. Lately I have had the dreams again about the person I am with now. My mom and god are again in the dream. This time it's a like a news story for a very serious accident, I see a person in a truck change from one face to the person I am with now crashing into the cars etc. I then see the tail end of a motorcycle which we have and the plate number 5CJ542 I woke up after that. It took me several days to look at the plate number on the bike as I didn't know what it was. It matched. My mom and his mom who I just talked to last week had told me not to worry about him She will see him soon and that he has some work to do before going to where they are. I have talked to a lady whose has physic abilities and read tarot. I told about my dreams I have been having and she showed the lines of where we will be in line. Mine continues and his stops. She doesn't tell people if she sees death because it upsets them but she had my mom there and told me. I have also recently had the dreams where my mom and god have let me know of 2 other people I may lose whose Initials are JOA and JAN, She wants me to warn them to take care and be safe. I also had a premonition for the lady who reads my tarot as she was having an over whelming feeling of bad sprits from a friends house. I asked my mom to show what is following her. My mom and god showed me in a dream about a woman running from aboriginal people from about 140 years about. She was caught by then and killed. The tribe did not agree with what their men were doing. I came across an open field with a ring of ancients ones crying in pure white dress and costume.\u003c/p\u003e","description_witness":"\u003cp\u003e I have always had premonitions or dead persons come in my dreams to talk to me.. I am female, 56 years old and live in Brandon Mb. I have 5 children 3 which also have the same types of dreams as I do. I just found this out recently.\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eThey always come in a form of a movie I am watching with my mom and god talking.\u003c/li\u003e\u003cli\u003eThey come in sequence when they feel I need to know more.\u003c/li\u003e\u003cli\u003eThey always have people I know have passed who do talk to me and let me know it will be okay.\u003c/li\u003e\u003cli\u003eThey can be anywhere from 6mos to 5 years before they happen.\u003c/li\u003e\u003cli\u003eOnce I have seen all the sequences of dreams I need to see they stop until the premonition happens.\u003c/li\u003e\u003cli\u003eI will have conversations with people who have passed on who let me know of things to come also.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Several premonitions"}
{"_id":{"$oid":"539e26d37734406005794e90"},"date":"20140504","date_not_format":"May 4, 2014","description":"\u003cp\u003eThe other day I was driving down the road, I commonly use. In this one spot there is always cars parked on the side, I have never not seen car parked here and I have been deriving this stretch for many years. I have never seem a police radar trap here, ever. They have been on this road before but never in this spot. As I turned onto this road, I had a strange feeling. I looked down the road in the direction of this spot where there was always cars parked and I instantly put my foot on the brake, it was completely unthinking, totally automatic. I was doing about 65 in a 50 zone, kilometres. I was quite a distance back not in radar range or visual range of anything other than these cars that were always parked there. There was something about one vehicle that was parked there. seeing it is what caused me to unconsciously brake. When I get closer a police officer stepped out from the cars and pointed his radar gun at my car. I wasn't speeding!!!\u003c/p\u003e\u003cp\u003eLater that day I was at home in the kitchen pouring myself a glass of water, I put the jug down that I was pouring from and turned around and picked up this package of probiotics that I have on my counter and started to read the name out loud. I thought this was rather odd behaviour, put the box down a little perplexed that I had just done that unthinkingly, and continued to pour my water. About two minutes later my IPad dings that I have a message. I go to look and see what the message says and it is from one of my sisters asking what the name of the probiotics is that I said she needed to get, the name i was just reading unconsciously.\u003c/p\u003e\u003cp\u003eThe next day my son wants me to come downstairs and look at the new bike he has just bought. As I walk into his room to see his bike, the first thing my eyes go to is the tires, and they kind of stay there looking at the tires on this beautiful new bike. I haven't even actually seen the bike because my eyes won't leave the back tire. He asked me what I think and it snaps my attention to the rest of the bike frame and appearance. Of course I tell him it is a beautiful new bike, all the while the only thing that is going through my head is that he is going to get flat tire, and I am trying to decide if I should say anything or not. I decide not to dismissing the thought and carry on with my day. Two days later my son phones me and says he has a flat tire and needs a ride to work.\u003c/p\u003e\u003cp\u003eMy life is full of these sort of moments. I have just been reflecting and hoping for some direction\u003c/p\u003e","description_witness":"\u003cp\u003eI am a female age 57, and I live in Victoria BC, Canada\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eAll my premonitions generally start as a feeling about something, then either a thought comes to my head about the feeling or something materializes related to the feeling. \u003c/li\u003e\u003cli\u003eI read Tarot so often images in the deck I use, Voyager Tarot by James Wanless 'speaks' to me also.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"I had a strange feeling"}
{"_id":{"$oid":"539e26d37734406005794e91"},"date":"20140409","date_not_format":"April 9, 2014 2:34pm","description":"\u003cp\u003eI had a dream on Monday night April 7 about 2 close friends who are getting married on Saturday April 12, 2014. In the dream I went by their house but was greeted by a grieving Nicole, as her Fiance' had passed away.\u003c/p\u003e\u003cp\u003eThis dream stayed with me as I woke [which is uncommon for me] and through the day I could not shake the feeling of dread.\u003c/p\u003e\u003cp\u003eToday is Wednesday April 9th and the feeling of dread and anxiety is stronger than before. i was driving to the gym and I saw my friends face in what looked like a coffin. the background behind his hair was white silky fabric and his eyes were closed and his hands were folded across his chest.\u003c/p\u003e\u003cp\u003eI can't seem to shake the image in my head now or the terrible anxiety and feeling of dread. \u003c/p\u003e\u003cp\u003eI had the very same feeling of dread and anxiety in January after a friends daughter had a terrible car accident. I knew the following day she was not going to survive, even thought I had no basis for this knowing.. the following day after that was when i experienced the intense feeling of dread.. I did not know until a few hours later that she had passed at the very hour I experienced the dread.\u003c/p\u003e","description_witness":"\u003cp\u003e51 Female in Tampa, Fl\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eFirst in a dream - then in a waking vision and feeling of dread\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Saw Coffin in Friend's Face"}
{"_id":{"$oid":"539e26d37734406005794e92"},"date":"20140404","date_not_format":"04/04/2014","description":"\u003cp\u003eI have had two reoccurring things happen to me in my dreams, the first one is where my best friends dad dies and I attend the funeral and the second one is where my sister's old boss Andy dies, they keep repeating themselves over and over again, nothing has transpired or happened yet, but they are strong feelings and I don't have any reasons to be thinking or dreaming about it. \u003c/p\u003e","description_witness":"\u003cp\u003eFemale, 30, Cornwall, UK\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eThey have come to me in very vivid dreams.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Recurring dreams"}
{"_id":{"$oid":"539e26d37734406005794e93"},"date":"20140529","date_not_format":"March 29, 2014 10:41 am","description":"\u003cp\u003eI was in Mexico on vacation this past week and I just got back on thursday. On monday night I had a dream my pet rabbit died. I kept trying to wake myself up to get out of that dream and every time I fell back asleep I kept going into the same dream. As soon as I got home my mom told me that my rabbit had passed away on tuesday morning, the morning after I had that dream.\u003c/p\u003e","description_witness":"\u003cp\u003eI am a 20 year old female who lives in Illinois.\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eThe premonition came to me in a dream.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Dream my pet rabbit died"}
{"_id":{"$oid":"539e26d37734406005794e94"},"date":"20140325","date_not_format":"25/03/14 3:28","description":"\u003cp\u003eOn Thursday 26 day of June, the angels of light are to descend upon the world of Islam and Judaism destroying all followers.\u003c/p\u003e\u003cp\u003eOn the same date, the angels of darkness are to descend and destroy the followers of Catholicism.\u003c/p\u003e","description_witness":"\u003cp\u003eI am a 54 year old retired miner living in Wales, Britain.\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eAt about 4:30 on a Saturday in June last year, the energy Gabriel called for me to come to the clearing in a forest where I had previously seen a multitude of angels.\u003c/li\u003e\u003cli\u003eHe floated high above me and told me to cleanse my body. For eighty minutes I watched, through the eye of my mind, an immense trail of black-ribbon winding from my stomach. As the ribbon faded and stopped, a brilliant white light entered my stomach and I could see the raw muscle to my left-side. On the right-side I saw the head of a spear.\u003c/li\u003e\u003cli\u003eSince then, I have been able to call upon earthquakes and volcanos with the assistance of Gabriel and Michael.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"A multitude of angels"}
{"_id":{"$oid":"539e26d37734406005794e95"},"date":"20140316","description":"This is not a dream. March 16, 2014 while throwing some garbage in the bin, I had a premonition of the lost malaysian plane. In the bin I saw the plane , completely intact, sitting in a gorge. The gorge was egg shaped, and was surrounded by a white mass. The white mass could of been snow, or white wave caps of water. The passengers were leaving the aircraft and walking outside the plane on a ledge. This is the first time I have experienced this.","description_witness":"I am a 67 year old female. I live in Campbellford Ontario.","own_conclusions":"* Throwing out garbage. Saw in garbage bin.","status":"1","title":"Premonition of lost Malaysian plane"}
{"_id":{"$oid":"539e26d37734406005794e96"},"date":"20140317","date_not_format":"17.03.14 12.10pm","description":"\u003cp\u003eI had a dream 24 April 2013, where I woke up saying over and over in my head.\u003c/p\u003e\u003cp\u003e50 Hudson Street, 50 Hudson Street. In my dream I am in a very tall building. I feel nervous and uneasy. I want to get down. I look at my feet and I am wearing white flip flops. There are security men around. White Shirts. I feel I am in America, I feel New Jersey.\u003c/p\u003e\u003cp\u003e21 February 2014 I have a dream about a white plane. Looking from a distance I can see the plane descending, something is wrong but everything is quiet, no noise, no crash. I tell the person I am with to run away from the plane. Don't know who I am with. The number 6 seems significant. Not sure why.\u003c/p\u003e","description_witness":"\u003cp\u003eI am female 44 years of age, Coventry United Kingdom\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eTwo separate dreams. First one 24th April 2013. The second 21st February 2014\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"In my dream I am in a very tall building"}
{"_id":{"$oid":"539e26d37734406005794e97"},"date":"20140311","date_not_format":"Tuesday, March 11, 2014 -- 9:39 am","description":"\u003cp\u003eI have predicted many future events that have happened. My husband took his two boys back to their biological mother (we have split custody) and I felt the sense that they left something behind. They turned around to come back and get the youngest boys' toy that he left. I knew this; and had it waiting when they came home. Also, my husband called and before he could speak, I said that I knew he was calling for a measurement that he wrote down on a sheet of paper. Also, I have predicted unfortunate events, such as John's ex-wife harassing and terrorizing us, words said to us (from random family members), and so on. It can be scary but also helpful. No one believes me, that I have precognition. \u003c/p\u003e","description_witness":"\u003cp\u003eI am a 32 year old female from Alabama. I have two children and I am married.\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eThis came to me when I was a young child. I had major back pain and spent a lot of time alone. I was withdrawn and also bullied as a child. I do believe this type of existence brought on the precognition. \u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Predicted many future events"}
{"_id":{"$oid":"539e26d37734406005794e98"},"date":"20140310","date_not_format":"March 10, 2014 1:17pm PHIL Time","description":"\u003cp\u003eWhen the news about the missing Malaysian Airlines plane came out, my wife reminded me that I told her about a similar dream 2 weeks ago. This has been bothering me ever since. Trying to remember the dream, I saw a plane trailing smoke from its left side quite a distance from the wing. It was turning left when it fell to the sea near a 'dark' beach.\u003c/p\u003e\u003cp\u003eCan someone help me with this? I just might, JUST MIGHT, know where the plane is.\u003c/p\u003e\u003cp\u003eI am located in the Philippines. My local cellphone number is 09052924569. You can reply through this email address: emet.tenerife@gmail.com. I will be checking my mail regularly.\u003c/p\u003e\u003cp\u003eThank you.\u003c/p\u003e\u003cp\u003eEmeterio A. Tenerife\u003c/p\u003e\u003cp\u003eTarlac City\u003c/p\u003e\u003cp\u003eThe Philippines\u003c/p\u003e","description_witness":"\u003cp\u003estay at home guy\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eIn a dream about 2 weeks ago\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Missing Malaysian Airliner"}
{"_id":{"$oid":"539e26d37734406005794e99"},"date":"20140306","date_not_format":"March 6, 2014","description":"\u003cp\u003eBelieve there will be a bombing in a basement of a home in New England. The house is large \u0026amp; white with a big front porch, with fields adjacent. The victims will be a woman \u0026amp; 3 children. The perpetrator is another woman's husband. He is a big white man, flat face with thick jowls. He is missing one finger. Drives a red car, possibly a hatchback. A very dangerous man, a repeat future offender. Number 3 is involved, which means 3 days or the Month of March\u003c/p\u003e","description_witness":"\u003cp\u003esenior citizen, 73, near Indianapolis\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eWas reading a biography of Sally Morgan, psychic, before going to sleep. Had seen a crime show and am always concerned about children. Prior to meditation, these were my thoughts before going to sleep. There were so many specifics to this vision- felt it was important to share. \u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Bombing in a basement"}
{"_id":{"$oid":"539e26d37734406005794e9a"},"date":"20140226","date_not_format":"2-26-14 8:57 AM","description":"\u003cp\u003e2-26-2014 – Night of 25th morning of 26th.\u003c/p\u003e\u003cp\u003eDreamed that I was at a Dow Chemical invited community update (there is one set for March 5th that I was invited to attend) \u003c/p\u003e\u003cp\u003eI was in section A which was looking at the stage all the way to the right. The room was more an amphitheater setting, but with church style benches and the floor did not slope down a great deal. In fact very slightly if any. (This is not the set-up for the meeting for next week-that is more a ballroom setting)\u003c/p\u003e\u003cp\u003eI was sitting to the left side of the section about ¾ of the way back. A man and two colleagues came in the section and said loudly point out the Dow speaker or something similar. Didn’t say the name. I thought Earl Shipp, but upon waking and reflection he could have been referring to Andrew Liveris. My first thought was he was a sniper and he did have some bags with him. We all looked at each other and no one wanted to say anything. Some lady said, “he always looks fierce.” This is not the least bit true. He just watched all of us and sat his bags on a bench to the back of the left rows of our section towards the back. Never really had any strong impressions of the guys with him. The spokesman was dark tan, close cropped dark brown straight hair, square type face and head, not Asian I don’t think. Sturdily built. 6 footish 210 or so, but not fat. \u003c/p\u003e\u003cp\u003eThey did not take up our cell phones or anything. Just stood looking over the crowd and watching us. No one was on stage at this point and I did not see anyone I knew and people were still coming in. I had not seen Earl or Liveris, yet. I wanted to text someone, but I had not silenced my phone as yet and knew it would draw attention and again I didn’t know who to text since I didn’t see anyone I knew.\u003c/p\u003e","description_witness":"\u003cp\u003eFemaile, 53, Sweeny, TX\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eI had a Dream last night or early this morning.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"He always looks fierce"}
{"_id":{"$oid":"539e26d37734406005794e9b"},"date":"20140220","date_not_format":"February 20, 2014 8:36am PHL Time","description":"\u003cp\u003eDreamed of a big catastrophe, most possibly a huge earthquake. In my dream, news came out of a huge earthquake hitting the southern part of the Philippines. Some news reports said it was the strongest earthquake so far. I saw a map with a huge highlighted area covering an oblong area including the whole Mindanao area in Southern Philippines. The earthquake was so massive it was felt as far north as Luzon island in the Philippines. \u003c/p\u003e\u003cp\u003eI usually dream or feel earthquakes happening, and they do, but nothing as massive as this. I need this officially documented.\u003c/p\u003e","description_witness":"\u003cp\u003ehome based baker, male, 48 years old from Tarlac City, The Philipiines.\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eThis is actually the first time an earthquake came to my dreams. Usually, I get a shaking sensation around me when I feel an earthquake. Hope somebody can give me tips on how to enhance this. Yes, I want to develop whatever you call this.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Massive Earthquake"}
{"_id":{"$oid":"53a0b5c2fca7c9eda4000202"},"date":"20140616","date_not_format":"6/1/2014","description":"I dreamed that the date was Feb 15, 2015. Russia bombed USA. War started. There were air force planes flying overhead. There were food shortages and very high prices. A lot of people were without jobs.","description_witness":"\u003cp\u003eFemale, 59, Texas\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eRarely do I get an actual date in a dream. I woke up frightened but not surprised.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Feb 15, 2015"}
{"_id":{"$oid":"53a0b620cb6a46ad7d000205"},"date":"20140616","date_not_format":"20140616","description":"I received a flash vision while I was in my kitchen. I was told it is vital to have several gallons of water on hand per person in household. A disaster will make it difficult to get water, stock up. Time frame was a feeling of this summer, not totally clear.","description_witness":"\u003cp\u003eFemale, 59, Texas\u003c/p\u003e","own_conclusions":"\u003cul\u003e\u003cli\u003eI have had three flash vision which came true. A flash vision as I call it happens suddenly, out of clear blue, and like a rapid transfer of startling information. Other visions I've had are different in the picture shows against the background of my surroundings. In the flash vision it's like there is a down load without pictures.\u003c/li\u003e\u003c/ul\u003e","status":"1","title":"Flash vision"}
{"_id":{"$oid":"53d80687de03ee637c0228df"},"date":"20140717","description":"A big earthquake in California with volcanic eruption afterwards","title":"A big earthquake in California..."}
{"_id":{"$oid":"53d80687de03ee637c0228e0"},"date":"20140608","description":"A major earthquake in the San Andreas fault and the Cascadia fault. The Cascadia part was the worst. Off the coast of Washington but also a lesser one just inland.","title":"A major earthquake in the San ..."}
{"_id":{"$oid":"53d80687de03ee637c0228e1"},"date":"20140607","description":"An earthquake of M7.0+ causing at least 1000 fatalities will affect Iran (or possibly Turkey) on or about June 18, 2014.","title":"An earthquake of M7.0+ causing..."}
{"_id":{"$oid":"53d80688de03ee637c0228e2"},"date":"20140519","description":"Earth will be hit by a large asteroid at 2pm local time on 6th May 2027. Diameter of this object is 2 miles wide .It will hit [location specified]. The asteroid will come from the direction of the Sun.","title":"Earth will be hit by a large a..."}
{"_id":{"$oid":"53d80688de03ee637c0228e3"},"date":"20140419","description":"I had a dream that there would be some explosions from bombs. About three of them in three different areas but close together. This would happen in the summer time. [area identified].","title":"I had a dream that there would..."}
{"_id":{"$oid":"53d80688de03ee637c0228e4"},"date":"20140408","description":"I saw three explosions take place in [city named] within about a minute and a half, and they were in three separate locations..I'm sure the first one was in a [location named]. I felt that this took place in the early evening and it was still light. I feel that the explosions were caused by suicide bombers. All explosions seemed to be within a mile or so of each other.","title":"I saw three explosions take pl..."}
{"_id":{"$oid":"53d80689de03ee637c0228e5"},"date":"20140331","description":"Military type plane flying low suddenly explodes over a small neighborhood.","title":"Military type plane flying low..."}
{"_id":{"$oid":"53d80689de03ee637c0228e6"},"date":"20140331","description":"Vision that [Malaysian flight MH370] will be found at [description of location given, not in Indian Ocean]","title":"Vision that [Malaysian flight ..."}
{"_id":{"$oid":"53d80689de03ee637c0228e7"},"date":"20140327","description":"I dreamt that [Malaysian flight MH370] is not in the Indian Ocean. It is near [location given]","title":"I dreamt that [Malaysian fligh..."}
{"_id":{"$oid":"53d80689de03ee637c0228e8"},"date":"20140326","description":"Earthquake and tsunami on a large scale is coming to New Zealand. connected with a red moon. Days (29th and a day with a 3 in it). Strong possibilities for this year (April, June , October). and linked with Christchurch and Wellington. Think the Alpine involved.","title":"Earthquake and tsunami on a la..."}
{"_id":{"$oid":"53d8068ade03ee637c0228e9"},"date":"20140311","description":"[City named] - large concrete tower and other buildings collapse.","title":"[City named] - large concrete ..."}
{"_id":{"$oid":"53d8068ade03ee637c0228ea"},"date":"20140311","description":"Earthquake in Italy in about 6 months.","title":"Earthquake in Italy in about 6..."}
{"_id":{"$oid":"53d8068ade03ee637c0228eb"},"date":"20140204","description":"Earthquake. Blackout. Manila. Marikina Valley fault. Many will die.","title":"Earthquake. Blackout. Manila. ..."}
{"_id":{"$oid":"53d8068ade03ee637c0228ec"},"date":"20131218","description":"Earthquake in [exact location given]","title":"Earthquake in [exact location ..."}
{"_id":{"$oid":"53d8068ade03ee637c0228ed"},"date":"20131210","description":"Air Canada plane crash. Residential area of nice homes.","title":"Air Canada plane crash. Reside..."}
{"_id":{"$oid":"53d8068ade03ee637c0228ee"},"date":"20131116","description":"Media broadcasting the assassination of [named public figure] by means of 100 gunshots.","title":"Media broadcasting the assassi..."}
{"_id":{"$oid":"53d8068ade03ee637c0228ef"},"date":"20131107","description":"Massive oil disaster will occur when a ship wrecks ...oil spilling everywhere ...sea animals will perish and some crew on the ship will die ... Massive environmental disaster","title":"Massive oil disaster will occu..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f0"},"date":"20131107","description":"Miracles will take place that feature in the newspapers in France and then around the world.","title":"Miracles will take place that ..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f1"},"date":"20131107","description":"[Identified persons] will be assassinated in the next week.","title":"[Identified persons] will be a..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f2"},"date":"20131107","description":"Massive event either terrorist attack or mass shooting in [location and further details].","title":"Massive event either terrorist..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f3"},"date":"20131022","description":"Massive tsunami headed for Japan or Thailand","title":"Massive tsunami headed for Jap..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f4"},"date":"20131018","description":"Three or four events trigger tsunami in Tanzania. Many will die.","title":"Three or four events trigger t..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f5"},"date":"20130821","description":"Had a vision of 3 men on a yacht in the ocean. I saw the letter A for the location. It will make national news. Could be the Atlantic maybe Australia. They will die from capsizing in a large storm that they didn't see coming.","title":"Had a vision of 3 men on a yac..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f6"},"date":"20130820","description":"I saw a bus crash. It looked like a school bus. There were 48 people injured/ dead from the accident, mostly children. There was a huge fire. Most of the people died from the smoke inhalation ... \"Middle East\". I am not sure if it is Egypt. I thought it might be in India at first. No specifics on time.","title":"I saw a bus crash. It looked l..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f7"},"date":"20130820","description":"Had a vision of a 6.5 earthquake in Thailand that will affect 2,000-3,000 people. Supposed to happen January 2014, maybe a little sooner.","title":"Had a vision of a 6.5 earthqua..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f8"},"date":"20130727","description":"Something of great significance to happen in Mexico, in the year 2016. There was a large number 8 hovering in the sky, with people all crowded around. Though I wasn't given specifics, only that it was not of a good nature and when I asked what was happening I was told in 2, or the number 2.","title":"Something of great significanc..."}
{"_id":{"$oid":"53d8068ade03ee637c0228f9"},"date":"20130703","description":"I dreamt that [named person] would be succeeded in office by a man who is much older - maybe 80 years old.","title":"I dreamt that [named person] w..."}
{"_id":{"$oid":"53d8068ade03ee637c0228fa"},"date":"20130624","description":"The southeastern gulf coast will have a category 3-4 hurricane in mid September. The whole gulf coast will be affected from Louisiana to Florida.","title":"The southeastern gulf coast wi..."}
{"_id":{"$oid":"53d8068ade03ee637c0228fb"},"date":"20130615","description":"I dreamed of a tsunami which flooded more than one coastal city. It seemed to affect two completely different cities or places- areas that were separated by geographical barriers like mountains, a valley or a peninsula. The people affected were Anglo and I believe it might be a location like the Mediterranean or northern Europe. Whatever country this was, it is not a place where they often have tsunamis and it seemed unusual like a freak occurrence. Also, all the damage seemed to be restricted to flooding- like no earthquake damage.","title":"I dreamed of a tsunami which f..."}
{"_id":{"$oid":"53d8068ade03ee637c0228fc"},"date":"20130612","description":"Several earthquake premonitions for a major quake.","title":"Several earthquake premonition..."}
{"_id":{"$oid":"53d8068ade03ee637c0228fd"},"date":"20130605","description":"[Identified famous person] will be shot.","title":"[Identified famous person] wil..."}
{"_id":{"$oid":"53d8068ade03ee637c0228fe"},"date":"20130604","description":"Had a dream about a large commercial plane crashing. Major investigation will be underway, not a terroist attack. Will be a mechanical malfunction. Large number of casualties. I dreamed this 5 days ago and expect this to happen between June 5th and June 8th of 2013. This one will be catastrophic.","title":"Had a dream about a large comm..."}
{"_id":{"$oid":"53d8068ade03ee637c0228ff"},"date":"20130601","description":"Earthquake - Top right hand side of Australia.","title":"Earthquake - Top right hand si..."}
{"_id":{"$oid":"53d8068ade03ee637c022900"},"date":"20130523","description":"Very large earthquake(s) off coast of Northern California followed by tsunami over the Golden Gate bridge in San Francisco","title":"Very large earthquake(s) off c..."}
{"_id":{"$oid":"53d8068ade03ee637c022901"},"date":"20130503","description":"[Terrorist group named] - kidnappings and violence to increase between August 17-24.","title":"[Terrorist group named] - kidn..."}
{"_id":{"$oid":"53d8068ade03ee637c022902"},"date":"20130502","description":"Terrorist attack, maybe a bombing, in [city named].","title":"Terrorist attack, maybe a bomb..."}
{"_id":{"$oid":"53d8068ade03ee637c022903"},"date":"20120430","description":"I had a vision of the state of Texas with part of the \"continent\" lifting off. A jagged land mass would lift off from around the Monihans (in the western, mid-north section of the state) to around Corpus Christie area. A diagonal area: 2/3rds of the state would be lifted. I don't know what the effect of this kind of tectonic shift would be, just the graphic depiction of a map in 3 dimension with that area lifting and floating above the state.","title":"I had a vision of the state of..."}
{"_id":{"$oid":"53d8068ade03ee637c022904"},"date":"20130429","description":"[Coalition Forces named] attempting to catch or kill a leader of Taliban, maybe Mullah [name] or an Al Qaeda leader. I think it's Afghanistan. If I'm wrong it's Pakistan.","title":"[Coalition Forces named] attem..."}
{"_id":{"$oid":"53d8068ade03ee637c022905"},"date":"20130428","description":"Sometime soon, possibly within the next year, or even months, a member of [organisation named] very high in the hierarchy will be \"harvested\". This event will take place in [possible locations named], and I sense it is not a positive \"harvesting.\"","title":"Sometime soon, possibly within..."}
{"_id":{"$oid":"53d8068ade03ee637c022906"},"date":"20130427","description":"Between the years of 2050 and 2200 there will be a global natural disaster. Tsunamis will destroy nations. East coast of the United States has gone underwater for a short period of time. Millions of people fled to the Tsunami-Safe-Domes(TSDs). But sadly there wasn't enough time to save thousands of people that died. The domes were built to protect anybody from drowning. They were about 500 meters in diameter. Some were more than a 1000 meters.","title":"Between the years of 2050 and ..."}
{"_id":{"$oid":"53d8068ade03ee637c022907"},"date":"20130413","description":"[Named celebrity] dies in [named location] skiing vacation.","title":"[Named celebrity] dies in [nam..."}
{"_id":{"$oid":"53d8068ade03ee637c022908"},"date":"20130413","description":"[Named politician] will pass.","title":"[Named politician] will pass...."}
{"_id":{"$oid":"53d8068ade03ee637c022909"},"date":"20130413","description":"[Named celebrity] will die.","title":"[Named celebrity] will die...."}
{"_id":{"$oid":"53d8068ade03ee637c02290a"},"date":"20130413","description":"[Named] bridge will collapse due to earthquake 2013. Many people dead. 9.4 Ritcher Scale quake.","title":"[Named] bridge will collapse d..."}
{"_id":{"$oid":"53d8068ade03ee637c02290b"},"date":"20130410","description":"[Country named]. Soldiers running in a spread line gaining territories, encircling towns. Blazes. helicopters, inferno.","title":"[Country named]. Soldiers runn..."}
{"_id":{"$oid":"53d8068ade03ee637c02290c"},"date":"20130317","description":"Suicide bombing at [location named].","title":"Suicide bombing at [location n..."}
{"_id":{"$oid":"53d8068ade03ee637c02290d"},"date":"20130313","description":"A large flood either in east Texas or wooded area of western/mid NY state. Epic flood, with people found dead underneath bridges when water clears.","title":"A large flood either in east T..."}
{"_id":{"$oid":"53d8068ade03ee637c02290e"},"date":"20130312","description":"Severe mid spring blizzard around 1st or 2nd week of April. affecting the north east United states. NJ, PN, RI, DE, MD.","title":"Severe mid spring blizzard aro..."}
{"_id":{"$oid":"53d8068ade03ee637c02290f"},"date":"20130307","description":"[Named famous person] and [named famous person] both shall not make it to the end of the year.\nCalifornia will experience the worst drought it has had in 100 years.[Named country] will attack [named country] and [named country] this year.","title":"[Named famous person] and [nam..."}
{"_id":{"$oid":"53d8068ade03ee637c022910"},"date":"20130222","description":"A huge tidal wave in the early hours affecting Queensland, Australia.","title":"A huge tidal wave in the early..."}
{"_id":{"$oid":"53d8068ade03ee637c022911"},"date":"20130109","description":"There will be a bombing in the east of Afghanistan. Maybe soldiers of the ISAF will be killed, but I'm unsure of that.","title":"There will be a bombing in the..."}
{"_id":{"$oid":"53d8068ade03ee637c022912"},"date":"20121209","description":"Earthquake off coast of Washington. It feels like very early morning because it feels like people are responding out of sleep, (like foggy thinking). Also feels like emergency measures, maybe alert system along coast malfunctions.","title":"Earthquake off coast of Washin..."}
{"_id":{"$oid":"53d8068ade03ee637c022913"},"date":"20121123","description":"Terrorist missile attack on [exact location named]","title":"Terrorist missile attack on [e..."}
{"_id":{"$oid":"53d8068ade03ee637c022914"},"date":"20121114","description":"[Country named]. A body of a child will be found [circumstances of finding described]","title":"[Country named]. A body of a c..."}
{"_id":{"$oid":"53d8068ade03ee637c022915"},"date":"20121114","description":"Bombing in [Country named], maybe in [City named] in two weeks.","title":"Bombing in [Country named], ma..."}
{"_id":{"$oid":"53d8068ade03ee637c022916"},"date":"20121101","description":"[Country named]. A violent riot will erupt over controversial issues.","title":"[Country named]. A violent rio..."}
{"_id":{"$oid":"53d8068ade03ee637c022917"},"date":"20121028","description":"Tsunami. There was tornadoes, water, bridges were shaky  unstable ... rushing around and some kind of silence ... but it was definitely evening.","title":"Tsunami. There was tornadoes, ..."}
{"_id":{"$oid":"53d8068ade03ee637c022918"},"date":"20121027","description":"Floods. I saw lots of flooding and houses being torn down. People screaming. It almost looked like wave or something on an island. Palm trees but the area looked a litle run down. Cars being pushed and tossed around. The time frame looked like around May of 2013.","title":"Floods. I saw lots of flooding..."}
{"_id":{"$oid":"53d8068ade03ee637c022919"},"date":"20121024","description":"Terrorist bombings in [Syria, Iraq and three other named countries]","title":"Terrorist bombings in [Syria, ..."}
{"_id":{"$oid":"53d8068ade03ee637c02291a"},"date":"20120930","description":"Something bad is going to happen in Boston, Massachusetts. Maybe running amok, or a beginning terrorist attack.","title":"Something bad is going to happ..."}
{"_id":{"$oid":"53d8068ade03ee637c02291b"},"date":"20120923","description":"\nTerrorist attack in Lebanon.","title":"\nTerrorist attack in Lebanon...."}
{"_id":{"$oid":"53d8068ade03ee637c02291c"},"date":"20120915","description":"Huge earthquake [Missouri]. Most houses are leveled. Fires and no phones working.","title":"Huge earthquake [Missouri]. Mo..."}
{"_id":{"$oid":"53d8068ade03ee637c02291d"},"date":"20120821","description":"Terrorist attack in [possible countries named] involving missile fired at fighter jet.","title":"Terrorist attack in [possible ..."}
{"_id":{"$oid":"53d8068ade03ee637c02291e"},"date":"20120820","description":"Strangled girl found in water [two possible areas named and further details withheld]. Also a child goes missing [area named and further details withheld].","title":"Strangled girl found in water ..."}
{"_id":{"$oid":"53d8068ade03ee637c02291f"},"date":"20120702","description":"Earthquake located in France and Iceland (July 27). A really powerful earthquake (several major explosions also) that seemed to volley between France and Iceland and looked like two earthquakes piggybacking on top of each other. There was a brief respite then the second one struck.","title":"Earthquake located in France a..."}
{"_id":{"$oid":"53d8068ade03ee637c022920"},"date":"20120609","description":"A large dam compromised, not sure if by natural events or terrorist attack. A huge wall of water rushing down a high sided valley and destroying everything in its path. After dreaming this a couple of days later the word [Name] came into my mind and when I looked it up on the internet discovered it is a dam on the [Countries named] border.","title":"A large dam compromised, not s..."}
{"_id":{"$oid":"53d8068ade03ee637c022921"},"date":"20120505","description":"It was during daylight hours. There was a slight earthquake felt in the St Louis area of Missouri. Enough to give pause, but not extremely damaging","title":"It was during daylight hours. ..."}
{"_id":{"$oid":"53d8068ade03ee637c022922"},"date":"20120504","description":"Earthquake in Rome.","title":"Earthquake in Rome...."}
{"_id":{"$oid":"53d8068ade03ee637c022923"},"date":"20120428","description":"There will be a huge earthquake and a tsunami of water [United States]. I do not know which city, but water is near.","title":"There will be a huge earthquak..."}
{"_id":{"$oid":"53d8068ade03ee637c022924"},"date":"20120427","description":"[Country named] will attack [Country named] week of May 26.","title":"[Country named] will attack [C..."}
{"_id":{"$oid":"53d8068ade03ee637c022925"},"date":"20120426","description":"There will be an Earthquake off the west coast [of the US], which will trigger a Tsunami and Volcanic Eruption over a period of 3 days. There will be great loss of life and structure. It will be like the Quake in Japan, but somewhat worse. It will effect the whole of the country and it will be felt in places not expected too. There will be ash that will travel across, the country causing power failures and blackouts. The country will come to a stand still.","title":"There will be an Earthquake of..."}
{"_id":{"$oid":"53d8068ade03ee637c022926"},"date":"20120318","description":"I feel that most of the US will be experiencing drought within several months to a year.","title":"I feel that most of the US wil..."}
{"_id":{"$oid":"53d8068ade03ee637c022927"},"date":"20120113","description":"Kidnap/abduction attempt - is not successful - by 2 male persons and 1 female accomplice on [celebrity named] from a hotel. This may be a hotel in a foreign country - somewhere hot - or in the US in the summer months. A member of the hotels staff intervenes before she gets in the car - grey/blue people carrier with tinted windows - with these people.","title":"Kidnap/abduction attempt - is ..."}
{"_id":{"$oid":"53d8068ade03ee637c022928"},"date":"20111208","description":"Aircraft accident. [Aircraft model and livery described] coming into land in daylight, banks sharply and the right wing tip hits the ground (in a field with trees/bushes around the perimeter, and the plane breaks up.","title":"Aircraft accident. [Aircraft m..."}
{"_id":{"$oid":"53d8068ade03ee637c022929"},"date":"20111125","description":"Aircraft accident. I was walking on a road in the [area named]. It must have been after 15:00 because school children were walking home from school. I looked up at a plane travelling East, it had blue signage on its tail. I watched as the plane lost altitude then try to pull up. It did a sharp bank to the right and then dived down. I could see it was going to crash and hoped that it would land in the [river named] and not in a residential area. Some people on the street ran towards the direction of the crash, others stood staring in disbelief, in the direction of the crash. I did not want to run with the others to the crash because I knew there would be no survivors","title":"Aircraft accident. I was walki..."}
{"_id":{"$oid":"53d8068ade03ee637c02292a"},"date":"20111006","description":"Major hurricane to hit Texas within next month.","title":"Major hurricane to hit Texas w..."}
{"_id":{"$oid":"53d8068ade03ee637c02292b"},"date":"20111006","description":"Terrorist attack on [type of city described]","title":"Terrorist attack on [type of c..."}
{"_id":{"$oid":"53d8068ade03ee637c02292c"},"date":"20111003","description":"Avalanche will kill a famous female star on her vacation [country named]","title":"Avalanche will kill a famous f..."}
{"_id":{"$oid":"53d8068ade03ee637c02292d"},"date":"20110930","description":"Terrorist bombing in [country and city named]","title":"Terrorist bombing in [country ..."}
{"_id":{"$oid":"53d8068ade03ee637c02292e"},"date":"20110927","description":"Terrorist bombing in [country named]","title":"Terrorist bombing in [country ..."}
{"_id":{"$oid":"53d8068ade03ee637c02292f"},"date":"20110823","description":"Death of [famous person named] of natural causes around Dec 5th or 15th 2011.","title":"Death of [famous person named]..."}
{"_id":{"$oid":"53d8068ade03ee637c022930"},"date":"20110711","description":"Aircraft accident. I dreamed of a blue colored 747 in a midair collision with a smaller aircraft, perhaps a 757. I think it happened in [place named] ... These aircraft seemed to have some connection to [named] airport. Casualties were immense.","title":"Aircraft accident. I dreamed o..."}
{"_id":{"$oid":"53d8068ade03ee637c022931"},"date":"20110506","description":"Earthquake will hit from the top of north Queensland Australia down through the eastern coast across to Victoria.","title":"Earthquake will hit from the t..."}
{"_id":{"$oid":"53d8068ade03ee637c022932"},"date":"20110312","description":"Japan - On 11th March, 2011, Japan experienced a major earthquake and tsunami. Sadly, this event is only a prelude to a bigger, more catastrophic earthquake. I predict that Japan will experience another major earthquake between mid-March to mid-April (2011). This next earthquake will measure higher than 9.0 on the Richter Scale and will have a devastating effect on Japan's capital city, Tokyo.","title":"Japan - On 11th March, 2011, J..."}
{"_id":{"$oid":"53d8068ade03ee637c022933"},"date":"20110103","description":"Earthquake in Queensland, Australia","title":"Earthquake in Queensland, Aust..."}
{"_id":{"$oid":"53d8068ade03ee637c022934"},"date":"20101230","description":"In Sydney Australia, there will be a massive tsunami, the whole of the harbor will be affected. When the water recedes, the soil will be unusable, there will massive food shortages because of the salt. The whole of that area will become a dust bowl, worsening due to the lack of rain. People will start to move away from the area in droves. I cannot confirm a date or a time, though it will be during daylight hours.","title":"In Sydney Australia, there wil..."}
{"_id":{"$oid":"53d8068ade03ee637c022935"},"date":"20101101","description":"Possible terrorist attack [country named]","title":"Possible terrorist attack [cou..."}
{"_id":{"$oid":"53d8068ade03ee637c022936"},"date":"20100911","description":"[Country named] will experience an impact of a large meteorite and the US will try to help them recover","title":"[Country named] will experienc..."}
{"_id":{"$oid":"53d8068ade03ee637c022937"},"date":"20100905","description":"Cairns (Queensland, Australia) - In the week before Christmas 2010, Cairns will experience a major cyclone. The cyclone will slowly form over a period of about 7 days and, by the time it impacts the region, it will be a Category 5 cyclone. The cyclone will cross the coast in the early morning hours. Many buildings and houses will be significantly damaged, as will infrastructure such as electricity, phone lines and rail. Cairns CBD will have widespread damage. Banana and sugar cane crops will be obliterated in some areas, causing much difficulty for local farmers. There will be many minor injuries sustained by the local population, as well as a few deaths.","title":"Cairns (Queensland, Australia)..."}
{"_id":{"$oid":"53d8068ade03ee637c022938"},"date":"20100803","description":"Singapore. The sunny afternoon sky suddenly turned dark. I remember looking at the clock, it was around mid afternoon. A helium balloon floated past, at the sky and soon after, I saw 1-3 tornadoes forming. 1 of them was going down my street (I was looking out from the window) and suddenly the whole wall was pulled outwards by the tornado ... it wil probably happen in years to come.","title":"Singapore. The sunny afternoon..."}
{"_id":{"$oid":"53d8068ade03ee637c022939"},"date":"20100601","description":"An explosion of some kind happens in [US State named] ... The State sinks into the ocean.","title":"An explosion of some kind happ..."}
{"_id":{"$oid":"53d8068ade03ee637c02293a"},"date":"20100531","description":"In about 6 to 8 months a whole city a major city will be on fire lots of fire every wheresuch as we have never seen, i also see part of [US State named] underwater.","title":"In about 6 to 8 months a whole..."}
{"_id":{"$oid":"53d8068bde03ee637c02293b"},"date":"20100429","description":"New Zealand - there will be a large earthquake (more than 6.5) before the end of 2010, most likely between June - September. It will be located on the south island and cause the destruction of a large area. Houses, shops, roads and buildings in general will collapse. Sadly, there will be many people hurt or killed. The earthquake will also cause a tsumani, which will hit the south islands, as well as the east coast of Australia. The Australian east coast will not experience any major damage, but there will be some flooding to low-lying coastal areas from Queensland to Victoria.","title":"New Zealand - there will be a ..."}
{"_id":{"$oid":"53d8068bde03ee637c02293c"},"date":"20100422","description":"Mass shooting in [country named]. This event will occur soon within a few weeks and will involve fatalities. The attack takes place outside a property, maybe a pub, a frontal attack.","title":"Mass shooting in [country name..."}
{"_id":{"$oid":"53d8068bde03ee637c02293d"},"date":"20100417","description":"Within the next 6 months, New Zealand will suffer an earthquake. I see this happening around the south island. It will create a tsunami, which will affect the local area, as well as some eastern parts of Australia. Many building will be destroyed and there will be many people hurt.","title":"Within the next 6 months, New ..."}
{"_id":{"$oid":"53d8068bde03ee637c02293e"},"date":"20100323","description":"New Zealand. Christmas Eve specifically Christmas shopping - destructive earthquake. Building with scaffolding around collapes, pillars collapse, wires and poles coming down, reddish/brown coloured plaster on building falling-like art deco stuff. Concrete car park top layer collapse onto second layer.Didn't recognise place as somewhere I had been but inside shopping mall to start with. Think New Zealand - art Deco stuff common here.","title":"New Zealand. Christmas Eve spe..."}
{"_id":{"$oid":"53d8068bde03ee637c02293f"},"date":"20100306","description":"It's a fairly large street. There are many buildings surrounding it, one being especially bigger than all the others. There is a large pile-up that completely blocks the road and is on fire; in the center of the pile-up there is a huge red and white truck. There are many bodies strewn about, and the few that are alive are either screaming and sobbing or on fire, running about.","title":"It's a fairly large street. Th..."}
{"_id":{"$oid":"53d8068bde03ee637c022940"},"date":"20100118","description":"Terrible flood in Cornwall in the spring, when there are daffodils, possibly [town named].","title":"Terrible flood in Cornwall in ..."}
{"_id":{"$oid":"53d8068bde03ee637c022941"},"date":"20091208","description":"A UFO train crashes with red lights. Local villagers go to look and see and armed military personnel come out and forcefully vaccinate the village.","title":"A UFO train crashes with red l..."}
{"_id":{"$oid":"53d8068bde03ee637c022942"},"date":"20091113","description":"Airliner forced to make emergency landing on a motorway [Country named]","title":"Airliner forced to make emerge..."}
{"_id":{"$oid":"53d8068bde03ee637c022943"},"date":"20091003","description":"Evening [place named] Man running along the [place named], attacks woman, kills her, she is not the first. He is tall, dark hair, wearing a hat, dark blue with white stripe. His car has [place named] plates, parked along [place named] area. The other woman cell phone is inbetween his front seats, his number on it, he met her the night before.","title":"Evening [place named] Man runn..."}
{"_id":{"$oid":"552ab8ce6334380003000000"},"date":"20120430","description":"When I was 20 (yes over 30 years ago now) I had a vivid 5 sense vision of an explosion that caste a cloud of smoke over the entire Earth. I was sitting in a lecture at an Ohio college and felt compelled to close my eyes. I did and I immediately saw a crystal clear vision of the Earth. I felt like I had an ethereal body and I was above the Earth looking down from space. Smoke appeared in northern Europe and then encircle the Earth. After three rotations, it was well below the equator. I zoomed below the cloud and landed in Frankfurt. I was shocked at the vividness of the vision. I was in a class, so opened my eyes, but the vision remained vividly for 5 weeks. I saw great devastation in Germany in particular and contamination of water and soil around the planet. People \u0026 buildings in the blast zone looked like they were burned by something caustic, but many had avoided this and were helping others. There were many deaths. I heard, smelled, felt and even tasted all of this. I believed it to be summer. This went on for 5 weeks day and night, eyes closed or open. It was in addition to my normal thoughts, like I had 2 brains going at once, but the vision was sharper than I am capable of in my normal thoughts. It was like a 5 sense movie experience being streamed into my head-crystal clear. Later that year I went to Germany, it was my first time there, but I recognized Frankfurt from my vision. In Berlin, I saw people on the street and would then see them in their moment of the event. Some were badly hurt, some dead, some OK. I believe the event happened over a much greater area, but I was personally focused on Germany because of my study there. Nothing I thought had any effect on the vision. The event would cause greater death around the planet due to starvation and thirst in the following years. After 5 weeks I had lost 15 lbs. I begged and begged for the vision to be removed. For a fraction of a second I saw fields of flowers, I nearly passed out and then it all went away. I could remember, but not see the specific vivid detail like before.\r\n\r\nNow my guess is that Iceland will blow up big time. I was not shown this specifically. No thought I had had any effect on the vision stream. I was shown what I was shown. Last year I received the message of \"August 7\". Only those words, visually and audibly shouted-no year given-frustrating. I sort of feel my death is concurrent or that I will die just before the event. I do not know why. ","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"No trick, just spontaneous. I felt compelled to close my eyes in the middle of a college lecture. I did not put it together until this past year, but this vision came to me in the Spring of 1980. Mt. St. Helens blew May 18th. Our classes ended in late May, so the vision would have likely occurred in April. I thought I was going crazy, so I did not tell anyone and did not record it until later. I feel no connection of the two, but that is weird. ","premonition_come_true":"dontknow","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Vision of an explosion","type":"feelings","type_description":""}
{"_id":{"$oid":"552ab9876334380003010000"},"date":"20140408","description":" It was a few days after our school went into lock down \u0026 an officer was shot \u0026 put in the hospital. I was texting my boyfriend and he said he was at a funeral, instantly my first thought was \"Officer Schneider\" \u0026 I'd had enough of these to know that Officer Schneider was going to die. A few days later I thought I could look into it a little. So I just thought to myself \"Officer Schneider\" \u0026 I was in the hospital room that my grandfather was recently in, just above the bed \u0026 I saw a woman with a brunette perm down to her shoulders wearing a blue v-neck long sleeved shirt, she looked in her late 40's-early 50's. A girl sitting in a chair, she had light brown long hair, about 7 years old, her feet didn't touch the floor, \u0026 I couldn't make out her face but I knew she was the younger version of a girl I go to school with. And I saw a green slushie in a blue cup that you get from Kwik Trip sitting on the tray attached to the bed. Then a few days later I was watching T.V. \u0026 my mom asked if I wanted a slushie from Kwik Trip, then right before she left she got a notification on her phone saying that Officer Schneider had just died in the same hospital room I saw. The woman \u0026 the girl I'm still trying to figure out.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"    First part was a very strong, quick thought.\r\n    Second part was a thought that was more visual","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Officer Schneider","type":"feelings","type_description":""}
{"_id":{"$oid":"552aba226334380003020000"},"date":"20120512","description":"I was hit by a black car on the left hand side of my body. A second one occurred but it was a red car. My previous premonitions have a pattern - if it happens to me, in reality it happens to another person and vice versa.\r\n\r\nThis time, the cars hit me, so believe it will happen to somebody else. Earlier today I learned that a friend is buying a car. I knew it was black and told him to make sure it is fully safe and to be careful. He said 'I don't do careful, it's boring!!'\r\n\r\nI had the same premonition a few weeks ago and immediately thought of him. He hasn't had a car in quite some time and now that he is financially back on his feet he is buying one - tomorrow. I had no idea he was even thinking of buying a car again.\r\n\r\nI had goosepimples all over today when he told me about buying this car, sent a shiver through my spine.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"    First time I was sat on my door step having a cigarette. I felt like I had been hit by the car myself.\r\n    Second time I had a vision.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Hit by a black car","type":"visions","type_description":""}
{"_id":{"$oid":"552aba956334380003030000"},"date":"20120711","description":"I have had premonitions for the past 30 years and they are proven to have been accurate.\r\n\r\nI sensed the birth of my first nephew back in 1979 while I was stationed in the Air Force in Greece, by sister was living in Amarillo, Texas. She was in her 5th month of pregnancy when I started asking her how my nephew was. 4 months later she gave birth to her first son. When she got pregnant with her second child, I sensed the birth of her daughter in her 5th month. 9 months later, she gave birth to her daughter. I met my current wife while I was stationed in Cheyenne, Wyoming. When she got pregnant with our first child, I sensed and saw our daughter (in my wife's 5th month) 7 years in the future and saw her ridding a red tricycle with white handle bar grips and white tassels from each handle bar. She was riding her trike down an asphalt street with no curbs and as she turned to ride back to me, I squatted (with hands out in front of me to welcome her back) and saw her with blonde hair. I did not know why I saw the blonde hair, neither of our families have blonde hair. 7 years later I had bought her a red tricycle for Christmas with white handle bar grips and white tassels (not applying anything to any previous dream). We were living in a trailer park, it was late on a Sunday evening. As she rode off into the distance and turned around, I squatted to welcome her back (as previously seen) and saw the sunlight shinning through her thin hair as a snapshot out of time.\r\n\r\nMy sister had gotten used to me seeing the future and one day, I called her up and told her mom was going to pass away in a year and described exactly how she would be found. My sister was having mom call her to make sure she was ready for work, and a year later, mom didn't call her. Sister went to find out what was wrong with her and found her exactly the way I described a year earlier.\r\n\r\nI know I've saved my son's life twice in his life and he's only 22 years old today. When he was in his 11th grade, I pulled him off his football team because I saw in a vision, him getting tackled on a field goal run and dying from the \"dog pile\" from a heart attach. 2 years later, he had a physical and the doctor told us that his heart wasn't built (created) right and that if he ever got an direct impact to the chest (heart area), he would suffer from a heart attach.\r\n\r\nI have seen my future several times and even after not effecting the known outcome, I've experienced the outcome I witnessed previously.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"I am a male 52 years old and live in Round Rock, Texas. My wife and I have been married 30+ wonderful years and we have two wonderful children. A 30 year old daughter, a 22 year old son. God has blessed us with watching over us and taking care of all four of us for the past many years.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Sensed the birth of my nephew","type":"feelings","type_description":""}
{"_id":{"$oid":"552abb246334380003040000"},"date":"20140624","description":"For the past WEEK OR SO, I've been having bad feelings, like extreme sadness which envelopes me at certain times each day. I feel an overwhelming premonition like things are going to go downhill really fast. I have dreams that people are asking me tons of questions about what happened and how do I feel about it. Also, I dream Mom and Daddy, who've been passed away for several years. They keep telling me that things are going to be alright. When I'm watching TV or listening to music, I'll get an overwhelming premonition like I'm going to be in some kind of danger, and then I feel an extreme sense of sadness, like I did when Mom and Daddy first passed. Lately, I get an awful feeling like I'm being watched and I sense a presence watching me. Two days ago the feeling of sadness was so great that I didn't want to get up from bed. I wanted to just stay there because I felt safe there. Also, I keep dreaming that somebody is shouting at me like they are angry at me and they accuse me of doing horrible things. I wake up in a cold sweat and it takes me awhile to get back to sleep. I keep putting it down as being bad nerves or something I ate, but the feeling of foreboding is very strong. ","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"A lot of times, I'll just be sitting down watching TV, or reading one of my favorite books. The strange thing about this premonition, it happens when I'm completely relaxed and having fun doing things. I'm not even thinking about anything and suddenly, it's like a voice is warning me to 'be careful'. ","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Bad feelings","type":"feelings","type_description":""}
{"_id":{"$oid":"552abbfd6334380003050000"},"date":"20140625","description":"I'm an average guy in year 10 in England. I enjoy sports for the fun and have many friends in school. We always have a great time and laugh because of it. I'm male, 15 and I live in South Ruislip, England.\r\n\r\nI had a dream about a girl at my school about a week ago. She called me on facebook messenger and it went to some sort of video call where I could see her. She seemed to of put her phone down and was wearing clothes (obviously) the room she was in seemed to be her bedroom. And I must admit it was pretty big. I think she may or may not of had a friend in the room. I somehow done something that allowed me to do the same option that she did, and so we could see each other. At the time of this phone thing it was day time and I was in my tiny bedroom. The door was open and I believe I could hear my dad talking to my mum. I was in my school clothes, and lying of my front on my bed.\r\n\r\nThis is all it was but it felt like a future foreshadowing. I have a feeling that if I say no this future dream I had would not happen, but I think if I said yes it would happen somehow, considering my phone isn't very capable of doing many things as it is 2 years old and really slow.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"    I had a feeling she liked me since she added me and started talking to me, and has been now since we met for the first time at a rounders club about 4 weeks ago on Tuesday 4pm. And now she sent me a message saying \"Will you go out with me??\" and just went off of facebook. (Probably embarassed and hoping for a positive response). I played it safe saying some random things about sports day. Then said \"Uhh ok? What time and place?\" And she still hasn't replied.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"We could see each other","type":"dreams","type_description":""}
{"_id":{"$oid":"552abc686334380003060000"},"date":"20140625","description":"I am a girl that died and came back after tyring to help someone 7 and a half years ago. Ever since, my abilities that I tried so hard to ignore before have gotten stronger and have become a disruption in my life. So rather than ignore them any more, I am going to try and expand them.\r\n\r\nI was at my doctors office and looked at y x-ray. There was a new break in my pelvis that no one else saw but me. I had my vision that I will brake my hip soon. I don't know how, or why. But it looks like it will be very painful.\r\n\r\nI see events that ends up either being something being bad in the future, or I sense something about the coming future in a vision that no one can see but me. Then it always comes true. I have heard spirits and seen them as well after my accident. I died and came back and did not tell anyone what I have experienced due to the crazy label that goes along with it.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"    It comes in a flash, while I am awake, just going about my day. No dreams, no weird feelings except for afterwards. I would like to learn these skills better. They have increased after my death and shock back to life. ;-)","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Died and came back","type":"visions","type_description":""}
{"_id":{"$oid":"552abcb16334380003070000"},"date":"20140717","description":"The early morning hours of July 1, 2014 I had one of those 'realer-than-real' dreams of an immense cloud (white) coming over the entire world like a curtain or shade being pulled - then there appeared a large passenger plane that came out from above those clouds as they continued covering the world and the plane clearly now proceeded the clouds. I was with my ex from Sacramento and my daughter and her two children, which seemed odd, but not extremely important. That morning I wrote this on my calendar: Dream re: plane destroying the world - with GJ, Jo, Joz, Jonas \u0026 me.\r\n\r\nToday is 7/17/14 and I believe the passenger plane I saw in the dream was the Malaysian flight that was shot down this AM. I am now most concerned about the cloud covering the earth that followed that plane. The significance of my relatives in the dream I equate to on 7/14/14 Jo left GJ in Sacramento to travel to my home in Oregon with Joz and Jonas to spend time with me on their way home to No. Oregon. No biggie - just time placement. The biggie is the cloud - It is a terrible feeling to be left with as the plane DIDN'T destroy the world - the world destroyed the plane and what remains is the cloud covering everything. God help us all - I have no further info or feelings - just that it is very possible this plane being shot down is the start of some impending cloud over us all.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"I had this dream the morning of July 1st 2014 and, although confounding, was easily remembered and reviewed upon waking. In fact, I cannot easily remember the people references now, but I can easily see the video of the fast moving curtain of clouds and the plane as it is burned in my usually forgetful memory.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Passenger plane I saw in the dream","type":"dreams","type_description":""}
{"_id":{"$oid":"552abd106334380003080000"},"date":"20140720","description":"Ive had Premonitions for years now and after having dreams of major events before they happen, ( Flight 370 , Mylasian airlines flight mh 17)\r\n\r\nI am recording these events.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"In a dream, most for the time i was in bed with this premonition","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Some kind of attack","type":"dreams","type_description":""}
{"_id":{"$oid":"552abda96334380003090000"},"date":"20140725","description":"Male, 38 from Scotland UK. Live in Glasgow and have always had visions and dreams that sometimes come to pass. Sometimes I interpret the visions or dreams slightly wrongly but other times have been very close.\r\n\r\nI haven't only recently started documenting my visions and dreams as they have been getting stronger and more frequent.\r\n\r\nMy premonition or prediction\r\n\r\nOn 14th July 2014 I was feeling overwhelmed with what I call feelings so I lay down and tried to nap to let it pass, sometimes this feeling passes without event and I don't get or don't remember the premonition. However this time it was the strongest it had ever been. I fell asleep and began to dream.\r\n\r\nI dreamt of escaping a plane bound for destruction, running through a city on fire I met military who I over heard saying two big events had happened (In the dream I was thinking of a third but it was fleeting and so dismissed it), and after reaching the crash events I saw bodies in the wreckage which I saw as cars?. I met a family who I took to be alive in the dream (Maybe the ghosts of victims though) who asked to use my phone to call their family, but the phone wasn't working.\r\n\r\nAfter I woke I knew this was a strong premonition and the feelings were still fresh and raw, so I took to twitter and posted a series of date stamped messages summarising the dream.\r\n\r\n3 Days later two big planes crashed or were otherwise brought out of the sky, one was in a war zone (city on fire) and the other in a remote desert. MH17 and AH5017 in short succession. The third wasn't as big and although I didn't document it on twitter it did resonate with my thoughts in the dream.\r\n\r\n14th July 2014:\r\n\r\nhttps://twitter.com/PaulHanton/status/488798036530061312\r\n\r\nI wrote the date on the twitter message as 14th August but meant to write 14th July however the date stamp on the message is the date I had the dream.\r\n","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Plane bound for destruction","type":"dreams","type_description":""}
{"_id":{"$oid":"552abdf463343800030a0000"},"date":"20140809","description":"I am a girl, age 12 years and 25 days, I live in the Philippines.\r\n\r\nI predict about what would the answer of my math teacher's question which is \"what is the square root of 900?\" because before she will tell the answer, my mind just said to myself that the answer is 30 and my teacher asked me if I was sure. I told her yes and after we solve the question the answer was really 30.\r\n\r\nAnd I have this another prediction that my mind just suddenly said that my friend, Rein, is coming so what I did is to wait then a minute ago Rein did actually came to my house.\r\n\r\nLastly I have this thing in my mind that someone is using my laptop then I went upstairs and my cousin is actually watching a movie on my laptop.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"    I become calm then some messages just entered my mind telling me that it is going to happen. I don't know if I'm just that smart or I do have predictions. Just telling.\r\n    When It enters my mind I'll check if it will really happen and it does. If you were to tell your prediction you should have a record that you really did predict it.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Predicted math answer","type":"feelings","type_description":""}
{"_id":{"$oid":"552abe6263343800030b0000"},"date":"20140903","description":"I am a female, Sri Lankan Malay and live in Colombo, Sri Lanka. \r\nI have had dreams/premonitions since the age of thirteen. First of all I would like to narrate a dream I had of one of my three children.\r\n\r\nMy Elder Son – I was pregnant with my eldest son and he was due in mid April 1968. April is a very hot and humid month in my country. One day around the first week of April I could not sleep in my bedroom because I felt very sweaty and bothered. So I decided to sleep on the balcony adjoining my room. I was fast asleep when I suddenly heard a noise just above my head. I woke up and saw a large black cat staring at me. I got scared and shooed the cat away. The cat jumped onto the wall and then to the garden below. We did not have cats in our house or stray cats in the garden and I wondered from where the cat came. I fell asleep again and then I dreamt the words “BE CAREFUL, GOD IS WITH YOU” in big, bold letters. My beautiful baby boy was born on 18th April. I returned from the Nursing home after four days. On the second day of my arrival home I noticed that my stomach had bloated and I was in terrible pain. I immediately consulted a doctor who asked me to get admitted to hospital. At the hospital the doctor examined me and said that I was having urine infection and I was lucky to have come to the hospital if not my bladder would have burst and I would have died. The black cat appearing on the balcony was a bad omen and God gave me a warning and saved me as per the words appearing in my dream.\r\n\r\nMy daughter - Mid-December 1971 I dreamt that I was walking towards a large garden which was at an elevation. There was a house with an open verandah and people in white were all sitting silently and they looked very sad. There were a row of cars by the side of the road. The atmosphere was one of sorrow. When I went up to the middle of the garden, my paternal uncle (who had died about fifteen years before) appeared by my side and gave me a white sheet of paper and said “You will be alright”. I took the piece of paper but did not read the contents of it. I was eight months pregnant at that time. I told about this dream to my family, but they all took it lightly.\r\n\r\nOn Christmas day – December 25th 1971 – my late uncle’s 24 year old son paid us a surprise visit. We were very happy to see him as he rarely came to see us. From the time he came he was restless and was pacing the balcony. We were wondering why he looked so perturbed but nobody asked him","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":"    My maternal grandmother and father has had premonitions/dreams which I think I have inherited from them.\r\n    I am from a family of nine and I am the only one who is experiencing these premonitions and dreams.\r\n    I see mainly deaths.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"BE CAREFUL, GOD IS WITH YOU","type":"dreams","type_description":""}
{"_id":{"$oid":"552abeb863343800030c0000"},"date":"20141015","description":"I am a fifty-six year old female living in North Florida who was born with a strong intuition. I've had many premonitions, before this one, but usually keep them to myself or share them with a close friend. However, this one is different, in light of the terrorist treats facing our nation. \r\nI have been experiencing this overwhelming sense of dread or doom. My sleep pattern is becoming increasingly irregular, because of it. I have been crying a lot too, and filled with great sadness. I am becoming increasingly nervous - edgy. It is always the same, whenever I sense something bad is about to occur. It is usually isolated to myself or someone close to me. I told someone dear to me, this afternoon, that I felt something terrible is about to occur. At the time, and as is often the case. I could not get a direct grasp of what it might be. Then, this evening I felt it was going to occur in the middle of the country - Midwest. Now, at 9:28 pm on October 15, 2014, I received a strong sense that it could be during the World Series. It was after, I read online that the Kansas City Royals, Kansas City, MO are going to the series. I do not follow baseball anymore and so, was unaware that Kansas City was doing so well. I am hoping, that I am wrong, because I sense that it is going to be on a much larger scale of loss of life and mayhem, beyond the Boston Bombings and more like another 911. I sense a lot of sorrow, many injured and much loss of life.. I wish, I knew, someone trustworthy that I could tell who could prevent this from happening. I am writing it tonight to document what I have received thus far. I am hoping, this information will find its way to the right individuals that can deter and apprehend the potential perpetrators, before it actually occurs. Again, I stress, that I hope this information I've received is wrong!!! ","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"","more_premonitions":"","own_conclusions":" I am an empath and was born or inherited a keen sense of knowing from when I was a young child. I have always been extremely intuitive and have the ability to know, before something happens. Although, I don't always get a clear sense of what it might be. However, as I've matured, I am learning to listen and believe more and that has increased the accuracy. First, I get a sense of something about to happen. Then, after focusing my intent on knowing what it could be. I will receive the information either through images or just a sense of knowing and sometimes a bit of both.","premonition_come_true_description":"","someone_else":"","status":1,"tags":[],"time_more_premonitions":"","title":"Overwhelming sense of dread or doom","type":"feelings","type_description":""}
{"_id":{"$oid":"558d467d6630630003000000"},"date":"20150621","description":"I was listening to a female newsreader on radio, saying bombs had gone off in London trains. 54 people had died and hundreds injured. I woke my partner to tell him, as I was quite upset by the news, telling him what I just heard on the radio. He looked at me very strange, asked if i was awake, then reached over and turned the radio on! I was certain that I heard it on the radio, but it was never on.\r\n\r\nAround 2 weeks later, it happened.","location_premonition":"","location_premonition_description":"","location_user":"","location_user_description":"Sydney Australia","more_premonitions":"","own_conclusions":"","premonition_come_true_description":"","someone_else":"","status":0,"tags":[],"time_more_premonitions":"","title":"Bombings on trains","type_description":"Awoke early Sunday morning and was listening to news on radio. Radio had not actually been on."}
{"_id":{"$oid":"558d47a76630630003010000"},"date":"20150621","description":"I was listening to a female newsreader on radio, saying bombs had gone off in London trains. 54 people had died and hundreds injured. I woke my partner to tell him, as I was quite upset by the news, telling him what I just heard on the radio. He looked at me very strange, asked if i was awake, then reached over and turned the radio on! I was certain that I heard it on the radio, but it was never on.\r\n\r\nAround 2 weeks later, it happened.","location_premonition":"","location_premonition_description":"London UK","location_user":"","location_user_description":"Sydney Australia","more_premonitions":"","own_conclusions":"I take more notice of dreams","premonition_come_true":"yes","premonition_come_true_description":"I heard 54 people died, and not buses, only trains. Close enough to freak me out.","someone_else":"No","status":0,"tags":[],"time_more_premonitions":"Not sure. Sometimes I'll hear something on the news, always radio, and it's not on again next hour ","title":"Bombings on trains","type_description":"Awoke early Sunday morning and was listening to news on radio. Radio had not actually been on."}
